#+title: Agenda
* CH:1 Basics of GO
** Simple hello world program
#+BEGIN_SRC go
package main
import "fmt"
func main() {
	fmt.Println("Hello World")
}
#+END_SRC

#+RESULTS:
: Hello World
- Go natively handles Unicode
- Run command is:
  #+BEGIN_SRC sh
go run main.go
  #+END_SRC
- Build command is:
  #+BEGIN_SRC sh
go build main.go
  #+END_SRC

- Go code is organized into packages
- .go source files in a single directory
- Each source file begins with package
- Go standard library consists of 100 standard libraries
- main is a special packages in go. It defines a standalone executable program, not a library.
- In main package we have main func
** Command Line Args
- os package provides functions and other values for dealing with the operating system.
- os.Args is a slice of string.

